[
  {"type":"fact","text":"Kaffee wird aus geroesteten Samen der Kaffeekirsche gebrueht."},
  {"type":"fact","text":"Der Weltmarkt wird vor allem von zwei Arten dominiert: Arabica und Robusta."},
  {"type":"fact","text":"Kaffee waechst hauptsaechlich im Kaffeeguertel zwischen den Tropen."},
  {"type":"fact","text":"Arabica waechst haeufig in hoeheren Lagen als Robusta."},
  {"type":"fact","text":"Robusta enthaelt meist mehr Koffein als Arabica."},
  {"type":"fact","text":"Espresso entsteht, wenn heisses Wasser unter Druck durch feines Kaffeemehl fliesst."},
  {"type":"fact","text":"Entkoffeinierter Kaffee enthaelt weiterhin eine kleine Menge Koffein."},
  {"type":"fact","text":"Fuer die meisten Erwachsenen gelten laut FDA bis zu 400 mg Koffein pro Tag als sicher."},
  {"type":"fact","text":"Eine Kaffeekirsche enthaelt meist zwei Samen, die wir Bohnen nennen."},
  {"type":"fact","text":"Eine Peaberry ist eine runde Einzelbohne statt zweier flacher Samen."},
  {"type":"fact","text":"Kaffeeblueten sind weiss und riechen oft leicht nach Jasmin."},
  {"type":"fact","text":"Kaffeebohnen sind Samen und keine echten Huelsenfrucht-Bohnen."},
  {"type":"fact","text":"Instantkaffee wird oft per Sprueh- oder Gefriertrocknung hergestellt."},
  {"type":"fact","text":"Dunkle Roestungen verlieren mehr Masse als helle Roestungen."},
  {"type":"fact","text":"Der Mahlgrad beeinflusst Extraktionszeit und Geschmack sehr stark."},
  {"type":"fact","text":"Cold Brew wird ueber viele Stunden mit kuehlem Wasser extrahiert."},
  {"type":"fact","text":"Cappuccino ist nach der Farbe von Kapuzinerroben benannt."},
  {"type":"fact","text":"Latte bedeutet auf Italienisch schlicht Milch."},
  {"type":"fact","text":"Espresso-Crema entsteht aus Oelen, Gasen und Bruehdruck."},
  {"type":"fact","text":"Frisch geroesteter Kaffee gibt noch Tage lang CO2 ab."},
  {"type":"fact","text":"Wasserqualitaet kann den Kaffeegeschmack deutlich veraendern."},
  {"type":"fact","text":"Papierfilter halten meist mehr Oele zurueck als Metallfilter."},
  {"type":"fact","text":"Arabica wird oft als suesser und saeurereicher beschrieben als Robusta."},
  {"type":"fact","text":"Robusta wird oft als kraeftiger, koerperreicher und bitterer beschrieben."},
  {"type":"fact","text":"Selektive Ernte nutzt reife Kirschen fuer bessere Tassenqualitaet."},
  {"type":"fact","text":"Brasilien ist seit vielen Jahren der groesste Kaffeeproduzent."},
  {"type":"fact","text":"Finnland wird haeufig unter den Spitzenreitern beim Pro-Kopf-Kaffeekonsum genannt."},
  {"type":"fact","text":"Kaffee kam ueber Handelsrouten aus der arabischen Welt nach Europa."},
  {"type":"fact","text":"Aethiopien gilt weithin als Ursprung von Coffea arabica."},
  {"type":"fact","text":"Der Rekord fuer die groesste Tasse Kaffee liegt bei vielen tausend Litern."},
  {"type":"fact","text":"Der Roestgrad veraendert Aroma, Koerper und wahrgenommene Saeure."},
  {"type":"fact","text":"Scheibenmahlwerke liefern oft gleichmaessigeres Mahlgut als Schlagmesser."},
  {"type":"fact","text":"Beim Blooming kann zu Beginn eingeschlossenes CO2 entweichen."},
  {"type":"fact","text":"Die Koffein-Halbwertszeit liegt bei Erwachsenen oft bei einigen Stunden."},
  {"type":"fact","text":"Lagerung ohne Hitze, Licht und Feuchtigkeit haelt Kaffee laenger frisch."},

  {"type":"joke","text":"Ich mag meine Morgen wie meinen Espresso: kurz und intensiv."},
  {"type":"joke","text":"Entkoffeinierter Kaffee ist nur ein Fluestern von Kaffee."},
  {"type":"joke","text":"Mein Kaffee und ich haben eine latte Vertrauensprobleme."},
  {"type":"joke","text":"Ich bin nicht kaffeesuechtig. Das ist eine feste Beziehung."},
  {"type":"joke","text":"Espresso yourself, aber bitte erst nach einer Tasse."},
  {"type":"joke","text":"Ich habe einen Witz aufgebrueht, aber er war zu duenn."},
  {"type":"joke","text":"Erst Kaffee. Dann Erwachsensein. Vielleicht."},
  {"type":"joke","text":"Ich habe meinem Becher ein Geheimnis gesagt. Jetzt ist er voller Bohnen."},
  {"type":"joke","text":"Das Leben passiert. Kaffee hilft bei den Plot-Twists."},
  {"type":"joke","text":"Dieser Tag wird praesentiert von Koffein und Optimismus."},
  {"type":"joke","text":"Meine Blutgruppe ist vermutlich inzwischen Espresso."},
  {"type":"joke","text":"Ein Tag ohne Kaffee ist wie... keine Ahnung."},
  {"type":"joke","text":"Ich kann nicht espressoen, wie wichtig diese Tasse ist."},
  {"type":"joke","text":"Kaffee versteht mich besser als die meisten Meetings."},
  {"type":"joke","text":"Ich trinke Kaffee zu deiner Sicherheit."},
  {"type":"joke","text":"Keine Worte vor Bohnen-Saft."},
  {"type":"joke","text":"Kaffee: weil der Neustart beim Menschen dauert."},
  {"type":"joke","text":"Mein Kaffee ist heiss, mein Postfach eher nicht."},
  {"type":"joke","text":"Manche nennen es Chaos. Ich nenne es vor dem Kaffee."},
  {"type":"joke","text":"Ich wollte Motivation. Der Barista sagte: doppelter Shot."},
  {"type":"joke","text":"Die Bohne hat gesprochen: noch eine Tasse."},
  {"type":"joke","text":"Ich spreche fliessend Espresso und leichten Sarkasmus."},
  {"type":"joke","text":"Kaffee macht mich fast freundlich."},
  {"type":"joke","text":"Ich laufe auf Kaffee, Neugier und fragwuerdigen Plaenen."},
  {"type":"joke","text":"Wenn Stress Kalorien verbrennen wuerde, waere mein Kaffee zuckerfrei."},
  {"type":"joke","text":"Ich kam, ich sah, ich machte Kaffee."},
  {"type":"joke","text":"Meine Lieblingsuebung ist das wiederholte Heben dieser Tasse."},
  {"type":"joke","text":"Kaffee und Deadlines: ein Klassiker."},
  {"type":"joke","text":"Ich brauche keinen Therapeuten. Ich brauche frische Bohnen."},
  {"type":"joke","text":"Bean there, brewed that."},
  {"type":"joke","text":"Erst trinke ich Kaffee, dann tue ich Dinge."},
  {"type":"joke","text":"Ich habe einen dunklen Roast und eine helle Laune. Meist Roast."},
  {"type":"joke","text":"Hinter jeder erledigten Aufgabe steht eine verdaechtig leere Tasse."},
  {"type":"joke","text":"Kaffee ist meine liebste Morgen-Benachrichtigung."},
  {"type":"joke","text":"Ich mache Seafood-Diaet: Ich sehe Kaffee und trinke ihn."}
]
