[
  {"type":"fact","text":"Coffee is brewed from roasted seeds of the Coffea fruit."},
  {"type":"fact","text":"Most global coffee comes from two species: arabica and robusta."},
  {"type":"fact","text":"Coffee grows mainly in the Coffee Belt between the tropics."},
  {"type":"fact","text":"Arabica often grows at higher altitude than robusta."},
  {"type":"fact","text":"Robusta usually contains more caffeine than arabica."},
  {"type":"fact","text":"Espresso is brewed by forcing hot water through fine grounds under pressure."},
  {"type":"fact","text":"Decaf coffee still contains a small amount of caffeine."},
  {"type":"fact","text":"For most adults, up to 400 mg caffeine per day is considered safe by FDA guidance."},
  {"type":"fact","text":"A coffee cherry usually contains two seeds, which we call beans."},
  {"type":"fact","text":"A peaberry is a cherry with one rounded seed instead of two flat seeds."},
  {"type":"fact","text":"Coffee flowers are white and often smell like jasmine."},
  {"type":"fact","text":"Coffee beans are seeds, not true beans from legumes."},
  {"type":"fact","text":"Instant coffee is commonly made by spray-drying or freeze-drying brewed coffee."},
  {"type":"fact","text":"Dark roasting reduces bean mass more than lighter roasting."},
  {"type":"fact","text":"Grind size strongly affects extraction speed and flavor balance."},
  {"type":"fact","text":"Cold brew is extracted in cool water over many hours."},
  {"type":"fact","text":"Cappuccino got its name from the color of Capuchin robes."},
  {"type":"fact","text":"Latte means milk in Italian."},
  {"type":"fact","text":"Espresso crema forms from oils, dissolved gases, and pressure."},
  {"type":"fact","text":"Freshly roasted coffee releases CO2 for days after roasting."},
  {"type":"fact","text":"Water quality can change coffee taste dramatically."},
  {"type":"fact","text":"Paper filters usually remove more coffee oils than metal filters."},
  {"type":"fact","text":"Arabica is often described as sweeter and more acidic than robusta."},
  {"type":"fact","text":"Robusta is often described as stronger, heavier, and more bitter."},
  {"type":"fact","text":"Selective picking targets ripe cherries for better cup quality."},
  {"type":"fact","text":"Brazil has been the largest coffee producer for many years."},
  {"type":"fact","text":"Finland is often listed among the highest coffee consumers per person."},
  {"type":"fact","text":"Coffee reached Europe through trade routes from the Arab world."},
  {"type":"fact","text":"Ethiopia is widely cited as the origin of Coffea arabica."},
  {"type":"fact","text":"The largest cup of coffee record is measured in tens of thousands of liters."},
  {"type":"fact","text":"Roast level changes aroma compounds, body, and perceived acidity."},
  {"type":"fact","text":"Burr grinders usually produce a more consistent grind than blade grinders."},
  {"type":"fact","text":"Blooming coffee lets trapped CO2 escape at the start of brewing."},
  {"type":"fact","text":"Caffeine half-life in adults often ranges around a few hours."},
  {"type":"fact","text":"Storage away from heat, light, and moisture helps keep coffee fresher longer."},

  {"type":"joke","text":"I like my mornings like my espresso: short and intense."},
  {"type":"joke","text":"Decaf is just coffee trying to whisper."},
  {"type":"joke","text":"My coffee and I have a latte trust issues."},
  {"type":"joke","text":"I am not addicted to coffee. We are in a committed relationship."},
  {"type":"joke","text":"Espresso yourself, but maybe after one cup."},
  {"type":"joke","text":"I brewed a joke, but it came out too weak."},
  {"type":"joke","text":"Coffee first. Adulting second. Maybe."},
  {"type":"joke","text":"I told my mug a secret. Now it is full of beans."},
  {"type":"joke","text":"Life happens. Coffee helps with the plot twists."},
  {"type":"joke","text":"Today is sponsored by caffeine and optimism."},
  {"type":"joke","text":"My blood type is probably espresso now."},
  {"type":"joke","text":"A day without coffee is like... just kidding, I have no idea."},
  {"type":"joke","text":"I cannot espresso how much this cup means to me."},
  {"type":"joke","text":"Coffee understands me better than most meetings do."},
  {"type":"joke","text":"I drink coffee for your safety."},
  {"type":"joke","text":"No talkie before bean juice."},
  {"type":"joke","text":"Coffee: because rebooting humans takes time."},
  {"type":"joke","text":"My coffee is hot, my inbox is not."},
  {"type":"joke","text":"Some call it chaos. I call it pre-coffee."},
  {"type":"joke","text":"I asked for motivation. The barista said double shot."},
  {"type":"joke","text":"The bean has spoken: one more cup."},
  {"type":"joke","text":"I am fluent in espresso and mild sarcasm."},
  {"type":"joke","text":"Coffee makes me almost pleasant."},
  {"type":"joke","text":"I run on coffee, curiosity, and questionable plans."},
  {"type":"joke","text":"If stress burned calories, my coffee would be sugar free."},
  {"type":"joke","text":"I came, I saw, I made coffee."},
  {"type":"joke","text":"My favorite exercise is lifting this mug repeatedly."},
  {"type":"joke","text":"Coffee and deadlines: a classic pairing."},
  {"type":"joke","text":"I do not need a therapist. I need fresh beans."},
  {"type":"joke","text":"Bean there, brewed that."},
  {"type":"joke","text":"First I drink coffee, then I do things."},
  {"type":"joke","text":"I have a dark roast and a bright personality. Mostly roast."},
  {"type":"joke","text":"Behind every successful task is a suspiciously empty mug."},
  {"type":"joke","text":"Coffee is my favorite morning notification."},
  {"type":"joke","text":"I am on a seafood diet. I see coffee, I drink it."}
]
